STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233fxx_cm33.h
/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
/* c7amba_sci3_v3.0 */
typedef struct
{
  __IO uint32_t CR1;             /*!< USART Control register 1                    Address offset: 0x000 */
  __IO uint32_t CR2;             /*!< USART Control register 2                    Address offset: 0x004 */
  __IO uint32_t CR3;             /*!< USART Control register 3                    Address offset: 0x008 */
  __IO uint32_t BRR;             /*!< USART Baud rate register                    Address offset: 0x00C */
  __IO uint32_t GTPR;            /*!< USART Guard time and prescaler register     Address offset: 0x010 */
  __IO uint32_t RTOR;            /*!< USART Receiver timeout register             Address offset: 0x014 */
  __IO uint32_t RQR;             /*!< USART Request register                      Address offset: 0x018 */
  __IO uint32_t ISR;             /*!< USART Interrupt and status register         Address offset: 0x01C */
  __IO uint32_t ICR;             /*!< USART Interrupt flag Clear register         Address offset: 0x020 */
  __IO uint32_t RDR;             /*!< USART Receive Data register                 Address offset: 0x024 */
  __IO uint32_t TDR;             /*!< USART Transmit Data register                Address offset: 0x028 */
  __IO uint32_t PRESC;           /*!< USART Prescaler register                    Address offset: 0x02C */
  __IO uint32_t AUTOCR;          /*!< USART Autonomous mode Control register      Address offset: 0x030 */
       uint32_t RESERVED0[238];  /*!< Reserved                                    Address offset: 0x034-0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< USART Hardware Configuration register 2     Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< USART Hardware Configuration register 1     Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< USART version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< USART Identification register               Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< USART Size Identification register          Address offset: 0x3FC */
} USART_TypeDef;


/**
  * @brief USB_EHCI HOST Registers
  */
typedef struct
{
  __IO uint32_t HCCAPBASE;        /*!< Capability Register,                       Address offset: 0x00 */
  __IO uint32_t HCSPARAMS;        /*!< Structural Parameter Register              Address offset: 0x04 */
  __IO uint32_t HCCPARAMS;        /*!< Capability Parameter Register,             Address offset: 0x08 */
       uint32_t RESERVED1;        /*!< RESERVED1,                                 Address offset: 0x0C */
  __IO uint32_t USBCMD;           /*!< USB Command Register,                      Address offset: 0x10 */
  __IO uint32_t USBSTS;           /*!< USB Status Register,                       Address offset: 0x14 */
  __IO uint32_t USBINTR;          /*!< USB Interrupt Enable Register,             Address offset: 0x18 */
  __IO uint32_t FRINDEX;          /*!< USB Frame Index Register ,                 Address offset: 0x1C */
  __IO uint32_t CTRLDSSEGMENT;    /*!< Control Data Structure Selector Register,  Address offset: 0x20 */
  __IO uint32_t PERIODICLISTBASE; /*!< Periodic Frame List Base Address Register, Address offset: 0x24 */
  __IO uint32_t ASYNCLISTADDR;    /*!< Asynchronous List Address Register,        Address offset: 0x28 */
       uint32_t RESERVED2[9];     /*!< RESERVED2,                                 Address offset: 0x2C - 0x48 */
  __IO uint32_t CONFIGFLAG;       /*!< Configure Flag Register,                   Address offset: 0x50 */
  __IO uint32_t PORTSC[1];        /*!< Port Status and Control Register,          Address offset: 0x54 */
       uint32_t RESERVED3[15];    /*!< RESERVED3,                                 Address offset: 0x58 - 0x90 */
  __IO uint32_t INSNREG[7];       /*!< Implementation Register,                   Address offset: 0x94 - 0xAC */
} USBH_EHCI_TypeDef;

typedef struct
{
  /* Control and Status Registers */
  __IO uint32_t HCREVISION;           /*!< Host Controller Revision,             Address offset: 0x00 */
  __IO uint32_t HCCONTROL;            /*!< Host Controller Control,              Address offset: 0x04 */
  __IO uint32_t HCCOMMANDSTATUS;      /*!< Host Controller Command Status,       Address offset: 0x08 */
  __IO uint32_t HCINTERRUPTSTATUS;    /*!< Host Controller Interrupt Status,     Address offset: 0x0C */
  __IO uint32_t HCINTERRUPTENABLE;    /*!< Host Controller Interrupt Enable,     Address offset: 0x10 */
  /* Memory Pointers */
  __IO uint32_t HCHCCA;               /*!< Host Controller Communication Area,   Address offset: 0x18 */
  __IO uint32_t HCPERIODCURRENTED;    /*!< Current Isochronous or Interrupt ED,  Address offset: 0x1C */
  __IO uint32_t HCCONTROLHEADED;      /*!< Control Head ED,                      Address offset: 0x20 */
  __IO uint32_t HCCONTROLCURRENTED;   /*!< Control Current ED,                   Address offset: 0x24 */
  __IO uint32_t HCBULKHEADED;         /*!< Bulk Head ED,                         Address offset: 0x28 */
  __IO uint32_t HCBULKCURRENTED;      /*!< Bulk Current ED,                      Address offset: 0x2C */
  __IO uint32_t HCDONEHEAD;           /*!< Done Head,                            Address offset: 0x30 */
  /* Frame Counters */
  __IO uint32_t HCFMINTERVAL;         /*!< Frame Interval,                       Address offset: 0x34 */
  __IO uint32_t HCFMREMAINING;        /*!< Frame Remaining,                      Address offset: 0x38 */
  __IO uint32_t HCFMNUMBER;           /*!< Frame Number,                         Address offset: 0x3C */
  __IO uint32_t PERIODICSTART;        /*!< Periodic Start,                       Address offset: 0x40 */
  __IO uint32_t HCLSTHRESHOLD;        /*!< Low-Speed Threshold,                  Address offset: 0x44 */
  /* Root Hub Ports */
  __IO uint32_t HCRHDESCRIPTORA;      /*!< Root Hub Descriptor A,                Address offset: 0x48 */
  __IO uint32_t HCRHDESCRIPTORB;      /*!< Root Hub Descriptor B,                Address offset: 0x4C */
  __IO uint32_t HCRHSTATUS;           /*!< Root Hub Status,                      Address offset: 0x50 */
  __IO uint32_t HCRHPORTSTATUS0;      /*!< Root Hub Port Status (Port 1),          Address offset: 0x54 */
       uint32_t RESERVED[16];         /*!< Reserved,                             Address offset: 0x58 - 0x90 */
  __IO uint32_t INSNREG[2];           /*!< Implementation Registers,             Address offset: 0x94 - 0x9C */
} USBH_OHCI_TypeDef;

