STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233fxx_cm33.h
#define HPDMA1_Channel0_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel0_BASE_NS)
#define HPDMA1_Channel1_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel1_BASE_NS)
#define HPDMA1_Channel2_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel2_BASE_NS)
#define HPDMA1_Channel3_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel3_BASE_NS)
#define HPDMA1_Channel4_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel4_BASE_NS)
#define HPDMA1_Channel5_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel5_BASE_NS)
#define HPDMA1_Channel6_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel6_BASE_NS)
#define HPDMA1_Channel7_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel7_BASE_NS)
#define HPDMA1_Channel8_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel8_BASE_NS)
#define HPDMA1_Channel9_NS                  ((DMA_Channel_TypeDef *) HPDMA1_Channel9_BASE_NS)
#define HPDMA1_Channel10_NS                 ((DMA_Channel_TypeDef *) HPDMA1_Channel10_BASE_NS)
#define HPDMA1_Channel11_NS                 ((DMA_Channel_TypeDef *) HPDMA1_Channel11_BASE_NS)
#define HPDMA1_Channel12_NS                 ((DMA_Channel_TypeDef *) HPDMA1_Channel12_BASE_NS)
#define HPDMA1_Channel13_NS                 ((DMA_Channel_TypeDef *) HPDMA1_Channel13_BASE_NS)
#define HPDMA1_Channel14_NS                 ((DMA_Channel_TypeDef *) HPDMA1_Channel14_BASE_NS)
#define HPDMA1_Channel15_NS                 ((DMA_Channel_TypeDef *) HPDMA1_Channel15_BASE_NS)

#define HPDMA2_Channel0_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel0_BASE_NS)
#define HPDMA2_Channel1_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel1_BASE_NS)
#define HPDMA2_Channel2_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel2_BASE_NS)
#define HPDMA2_Channel3_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel3_BASE_NS)
#define HPDMA2_Channel4_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel4_BASE_NS)
#define HPDMA2_Channel5_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel5_BASE_NS)
#define HPDMA2_Channel6_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel6_BASE_NS)
#define HPDMA2_Channel7_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel7_BASE_NS)
#define HPDMA2_Channel8_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel8_BASE_NS)
#define HPDMA2_Channel9_NS                  ((DMA_Channel_TypeDef *) HPDMA2_Channel9_BASE_NS)
#define HPDMA2_Channel10_NS                 ((DMA_Channel_TypeDef *) HPDMA2_Channel10_BASE_NS)
#define HPDMA2_Channel11_NS                 ((DMA_Channel_TypeDef *) HPDMA2_Channel11_BASE_NS)
#define HPDMA2_Channel12_NS                 ((DMA_Channel_TypeDef *) HPDMA2_Channel12_BASE_NS)
#define HPDMA2_Channel13_NS                 ((DMA_Channel_TypeDef *) HPDMA2_Channel13_BASE_NS)
#define HPDMA2_Channel14_NS                 ((DMA_Channel_TypeDef *) HPDMA2_Channel14_BASE_NS)
#define HPDMA2_Channel15_NS                 ((DMA_Channel_TypeDef *) HPDMA2_Channel15_BASE_NS)

#define HPDMA3_Channel0_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel0_BASE_NS)
#define HPDMA3_Channel1_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel1_BASE_NS)
#define HPDMA3_Channel2_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel2_BASE_NS)
#define HPDMA3_Channel3_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel3_BASE_NS)
#define HPDMA3_Channel4_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel4_BASE_NS)
#define HPDMA3_Channel5_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel5_BASE_NS)
#define HPDMA3_Channel6_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel6_BASE_NS)
#define HPDMA3_Channel7_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel7_BASE_NS)
#define HPDMA3_Channel8_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel8_BASE_NS)
#define HPDMA3_Channel9_NS                  ((DMA_Channel_TypeDef *) HPDMA3_Channel9_BASE_NS)
#define HPDMA3_Channel10_NS                 ((DMA_Channel_TypeDef *) HPDMA3_Channel10_BASE_NS)
#define HPDMA3_Channel11_NS                 ((DMA_Channel_TypeDef *) HPDMA3_Channel11_BASE_NS)
#define HPDMA3_Channel12_NS                 ((DMA_Channel_TypeDef *) HPDMA3_Channel12_BASE_NS)
#define HPDMA3_Channel13_NS                 ((DMA_Channel_TypeDef *) HPDMA3_Channel13_BASE_NS)
#define HPDMA3_Channel14_NS                 ((DMA_Channel_TypeDef *) HPDMA3_Channel14_BASE_NS)
#define HPDMA3_Channel15_NS                 ((DMA_Channel_TypeDef *) HPDMA3_Channel15_BASE_NS)

#define HASH_NS                             ((HASH_TypeDef *) HASH_BASE_NS)
#define HASH_DIGEST_NS                      ((HASH_DIGEST_TypeDef *) HASH_DIGEST_BASE_NS)
#define RNG_NS                              ((RNG_TypeDef *) RNG_BASE_NS)
#define CRYP1_NS                            ((CRYP_TypeDef *) CRYP1_BASE_NS)
#define CRYP2_NS                            ((CRYP_TypeDef *) CRYP2_BASE_NS)
#define SAES_NS                             ((SAES_TypeDef *) SAES_BASE_NS)
#define PKA_NS                              ((PKA_TypeDef *) PKA_BASE_NS)
#define RAMCFG_SYSRAM_NS                    ((RAMCFG_TypeDef *) RAMCFG_SYSRAM_BASE_NS)
#define RAMCFG_SRAM1_NS                     ((RAMCFG_TypeDef *) RAMCFG_SRAM1_BASE_NS)
#define RAMCFG_SRAM2_NS                     ((RAMCFG_TypeDef *) RAMCFG_SRAM2_BASE_NS)
#define RAMCFG_RETRAM_NS                    ((RAMCFG_TypeDef *) RAMCFG_RETRAM_BASE_NS)
#define RAMCFG_BKPSRAM_NS                   ((RAMCFG_TypeDef *) RAMCFG_BKPSRAM_BASE_NS)
#define RAMCFG_VDERAM_NS                    ((RAMCFG_TypeDef *) RAMCFG_VDERAM_BASE_NS)
#define RISC_NS                             ((RISC_TypeDef *)        RISC_BASE_NS)
#define RIMC_NS                             ((RIMC_TypeDef *)        RIMC_BASE_NS)
#define RIFSC_ID_NS                         ((RIFSC_ID_TypeDef *)    RIFSC_ID_BASE_NS)
#define IAC_NS                              ((IAC_TypeDef *)         IAC_BASE_NS)
#define RISAF1_NS                           ((RISAF_TypeDef *)       RISAF1_BASE_NS)
#define RISAF2_NS                           ((RISAF_TypeDef *)       RISAF2_BASE_NS)
#define RISAF4_NS                           ((RISAF_TypeDef *)       RISAF4_BASE_NS)
#define RISAF5_NS                           ((RISAF_TypeDef *)       RISAF5_BASE_NS)
#define RISAB1_NS                           ((RISAB_TypeDef *)       RISAB1_BASE_NS)
#define RISAB2_NS                           ((RISAB_TypeDef *)       RISAB2_BASE_NS)
#define RISAB3_NS                           ((RISAB_TypeDef *)       RISAB3_BASE_NS)
#define RISAB4_NS                           ((RISAB_TypeDef *)       RISAB4_BASE_NS)
#define RISAB5_NS                           ((RISAB_TypeDef *)       RISAB5_BASE_NS)
#define RISAB6_NS                           ((RISAB_TypeDef *)       RISAB6_BASE_NS)

