STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233fxx_cm33.h
/* Bit fields for PWR_CPU2D2SR register */
#define PWR_CPU2D2SR_HOLD_BOOT_Pos             (0U)
#define PWR_CPU2D2SR_HOLD_BOOT_Msk             (0x1UL << PWR_CPU2D2SR_HOLD_BOOT_Pos)
#define PWR_CPU2D2SR_HOLD_BOOT                 PWR_CPU2D2SR_HOLD_BOOT_Msk  /*!< CPU2 HOLD_BOOT status flag.Set by hardware to indicate when the CPU2 is in HOLD_BOOT state.- 0: CPU2 is allowed to boot.- 1: CPU2 is maintained in HOLD_BOOT state by hardware.Refer to RCC specification for details on HOLD_BOOT processor state. */
#define PWR_CPU2D2SR_WFBEN_Pos                 (1U)
#define PWR_CPU2D2SR_WFBEN_Msk                 (0x1UL << PWR_CPU2D2SR_WFBEN_Pos)
#define PWR_CPU2D2SR_WFBEN                     PWR_CPU2D2SR_WFBEN_Msk  /*!< CPU2 Wait for boot enable status flag.Set by hardware to indicate when the CPU2 is in wait for boot enable state. Only applicable in Wakeup event mode.- 0: CPU2 is not in wait for boot enable state. Set at â0â in legacy boot mode.- 1: CPU2 is in wait for boot enable state. It will start once an event assign to him will be raised.Refer to RCC specification for details on HOLD_BOOT processor state. */
#define PWR_CPU2D2SR_CSTATE_Pos                (2U)
#define PWR_CPU2D2SR_CSTATE_Msk                (0x3UL << PWR_CPU2D2SR_CSTATE_Pos)
#define PWR_CPU2D2SR_CSTATE                    PWR_CPU2D2SR_CSTATE_Msk  /*!< CPU2 cluster state status flag.Set by hardware to indicate when the CPU2 is in CRun, CSleep or CStop states.- 00: CPU2 is in reset (Hold_boot or Wfben).- 01: CPU2 is in CRun state.- 10: CPU2 is in CSleep state.- 11: CPU2 is in CStop state. */
#define PWR_CPU2D2SR_DSTATE_Pos                (8U)
#define PWR_CPU2D2SR_DSTATE_Msk                (0x7UL << PWR_CPU2D2SR_DSTATE_Pos)
#define PWR_CPU2D2SR_DSTATE                    PWR_CPU2D2SR_DSTATE_Msk  /*!< System / D2 state status.Set by hardware to indicate when the system / D2 domain is in Run, Stop, LP-Stop, LPLV-Stop, Standby and VBAT modes.- 000: Run- 001: Stop- 010: LP-Stop- 011: LPLV-Stop- 100: Standby- 101: VBAT */

/* Bit fields for PWR_CPU3D3SR register */
#define PWR_CPU3D3SR_CSTATE_Pos                (2U)
#define PWR_CPU3D3SR_CSTATE_Msk                (0x3UL << PWR_CPU3D3SR_CSTATE_Pos)
#define PWR_CPU3D3SR_CSTATE                    PWR_CPU3D3SR_CSTATE_Msk  /*!< CPU3 cluster state status flag.Set by hardware to indicate when the CPU3 is in CRun, CSleep or CStop states.- 00: CPU3 is in reset.- 01: CPU3 is in CRun state.- 10: CPU3 is in CSleep state.- 11: CPU3 is in CStop state. */
#define PWR_CPU3D3SR_DSTATE_Pos                (8U)
#define PWR_CPU3D3SR_DSTATE_Msk                (0x7UL << PWR_CPU3D3SR_DSTATE_Pos)
#define PWR_CPU3D3SR_DSTATE                    PWR_CPU3D3SR_DSTATE_Msk  /*!< D3 state status.Set by hardware to indicate when the D3 domain is in SRun1/2/3, SStop1/2 and SStandby modes.- 000: SRun1- 001: SRun2- 010: SRun3- 011: SStop1- 100: SStop2- 101: SStandby (only accessible in Debug standby mode) */

/* Bit fields for PWR_VERR register */
#define PWR_VERR_MINREV_Pos                    (0U)
#define PWR_VERR_MINREV_Msk                    (0xfUL << PWR_VERR_MINREV_Pos)
#define PWR_VERR_MINREV                        PWR_VERR_MINREV_Msk  /*!< Minor revision number. */
#define PWR_VERR_MAJREV_Pos                    (4U)
#define PWR_VERR_MAJREV_Msk                    (0xfUL << PWR_VERR_MAJREV_Pos)
#define PWR_VERR_MAJREV                        PWR_VERR_MAJREV_Msk  /*!< Major revision number. */

/* Bit fields for PWR_IPIDR register */
#define PWR_IPIDR_ID_Pos                       (0U)
#define PWR_IPIDR_ID_Msk                       (0xffffffffUL << PWR_IPIDR_ID_Pos)
#define PWR_IPIDR_ID                           PWR_IPIDR_ID_Msk  /*!< Identifier of the PWR */

/* Bit fields for PWR_SIDR register */
#define PWR_SIDR_SID_Pos                       (0U)
#define PWR_SIDR_SID_Msk                       (0xffffffffUL << PWR_SIDR_SID_Pos)
#define PWR_SIDR_SID                           PWR_SIDR_SID_Msk  /*!< Decoding space is 1 KB */

/******************************************************************************/
/*                                                                            */
/*                      SRAMs configuration controller                        */
/*                                                                            */
/******************************************************************************/
/****************  Bit definition for RAMCFG_*RAM_CR registers  ***************/
#define RAMCFG_CR_ECCE_Pos                  (0U)
#define RAMCFG_CR_ECCE_Msk                  (0x1UL << RAMCFG_CR_ECCE_Pos)           /*!< 0x00000001 */
#define RAMCFG_CR_ECCE                      RAMCFG_CR_ECCE_Msk                      /*!< ECC Enable */
#define RAMCFG_CR_ALE_Pos                   (4U)
#define RAMCFG_CR_ALE_Msk                   (0x1UL << RAMCFG_CR_ALE_Pos)            /*!< 0x00000010 */
#define RAMCFG_CR_ALE                       RAMCFG_CR_ALE_Msk                       /*!< Address Latch Enable */
#define RAMCFG_CR_SRAMER_Pos                (8U)
#define RAMCFG_CR_SRAMER_Msk                (0x1UL << RAMCFG_CR_SRAMER_Pos)         /*!< 0x00000100 */
#define RAMCFG_CR_SRAMER                    RAMCFG_CR_SRAMER_Msk                    /*!< SRAM Erase */
#define RAMCFG_CR_SRAMHWERDIS_Pos           (12U)
#define RAMCFG_CR_SRAMHWERDIS_Msk           (0x1UL << RAMCFG_CR_SRAMHWERDIS_Pos)    /*!< 0x00001000 */
#define RAMCFG_CR_SRAMHWERDIS               RAMCFG_CR_SRAMHWERDIS_Msk               /*!< SRAM Hardware Erase Disable */

/***************  Bit definition for RAMCFG_*RAM_IER registers  ***************/
#define RAMCFG_IER_SEIE_Pos                 (0U)
#define RAMCFG_IER_SEIE_Msk                 (0x1UL << RAMCFG_IER_SEIE_Pos)          /*!< 0x00000001 */
#define RAMCFG_IER_SEIE                     RAMCFG_IER_SEIE_Msk                     /*!< ECC Single Error Interrupt Enable */
#define RAMCFG_IER_DEIE_Pos                 (1U)
#define RAMCFG_IER_DEIE_Msk                 (0x1UL << RAMCFG_IER_DEIE_Pos)          /*!< 0x00000002 */
#define RAMCFG_IER_DEIE                     RAMCFG_IER_DEIE_Msk                     /*!< ECC Double Error Interrupt Enable */

