STMicroelectronics/STM32CubeMP2/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp233fxx_cm33.h
/* Bit fields for USB3_GDBGEPINFO1 register */
#define USB3_GDBGEPINFO1_EPDEBUG_Pos                             0
#define USB3_GDBGEPINFO1_EPDEBUG_Msk                             (0xFFFFFFFFUL << 0)
#define USB3_GDBGEPINFO1_EPDEBUG                                 (0xFFFFFFFFUL << 0)

/* Bit fields for USB3_GPRTBIMAP_HSLO register */
#define USB3_GPRTBIMAP_HSLO_BINUM1_Pos                           0
#define USB3_GPRTBIMAP_HSLO_BINUM1_Msk                           (0xfUL << 0)
#define USB3_GPRTBIMAP_HSLO_BINUM1                               (0xfUL << 0)
#define USB3_GPRTBIMAP_HSLO_BINUM2_Pos                           4
#define USB3_GPRTBIMAP_HSLO_BINUM2_Msk                           (0xfUL << 4)
#define USB3_GPRTBIMAP_HSLO_BINUM2                               (0xfUL << 4)
#define USB3_GPRTBIMAP_HSLO_BINUM3_Pos                           8
#define USB3_GPRTBIMAP_HSLO_BINUM3_Msk                           (0xfUL << 8)
#define USB3_GPRTBIMAP_HSLO_BINUM3                               (0xfUL << 8)
#define USB3_GPRTBIMAP_HSLO_BINUM4_Pos                           12
#define USB3_GPRTBIMAP_HSLO_BINUM4_Msk                           (0xfUL << 12)
#define USB3_GPRTBIMAP_HSLO_BINUM4                               (0xfUL << 12)
#define USB3_GPRTBIMAP_HSLO_BINUM5_Pos                           16
#define USB3_GPRTBIMAP_HSLO_BINUM5_Msk                           (0xfUL << 16)
#define USB3_GPRTBIMAP_HSLO_BINUM5                               (0xfUL << 16)
#define USB3_GPRTBIMAP_HSLO_BINUM6_Pos                           20
#define USB3_GPRTBIMAP_HSLO_BINUM6_Msk                           (0xfUL << 20)
#define USB3_GPRTBIMAP_HSLO_BINUM6                               (0xfUL << 20)
#define USB3_GPRTBIMAP_HSLO_BINUM7_Pos                           24
#define USB3_GPRTBIMAP_HSLO_BINUM7_Msk                           (0xfUL << 24)
#define USB3_GPRTBIMAP_HSLO_BINUM7                               (0xfUL << 24)
#define USB3_GPRTBIMAP_HSLO_BINUM8_Pos                           28
#define USB3_GPRTBIMAP_HSLO_BINUM8_Msk                           (0xfUL << 28)
#define USB3_GPRTBIMAP_HSLO_BINUM8                               (0xfUL << 28)

/* Bit fields for USB3_GPRTBIMAP_HSHI register */
#define USB3_GPRTBIMAP_HSHI_BINUM9_Pos                           0
#define USB3_GPRTBIMAP_HSHI_BINUM9_Msk                           (0xfUL << 0)
#define USB3_GPRTBIMAP_HSHI_BINUM9                               (0xfUL << 0)
#define USB3_GPRTBIMAP_HSHI_BINUM10_Pos                          4
#define USB3_GPRTBIMAP_HSHI_BINUM10_Msk                          (0xfUL << 4)
#define USB3_GPRTBIMAP_HSHI_BINUM10                              (0xfUL << 4)
#define USB3_GPRTBIMAP_HSHI_BINUM11_Pos                          8
#define USB3_GPRTBIMAP_HSHI_BINUM11_Msk                          (0xfUL << 8)
#define USB3_GPRTBIMAP_HSHI_BINUM11                              (0xfUL << 8)
#define USB3_GPRTBIMAP_HSHI_BINUM12_Pos                          12
#define USB3_GPRTBIMAP_HSHI_BINUM12_Msk                          (0xfUL << 12)
#define USB3_GPRTBIMAP_HSHI_BINUM12                              (0xfUL << 12)
#define USB3_GPRTBIMAP_HSHI_BINUM13_Pos                          16
#define USB3_GPRTBIMAP_HSHI_BINUM13_Msk                          (0xfUL << 16)
#define USB3_GPRTBIMAP_HSHI_BINUM13                              (0xfUL << 16)
#define USB3_GPRTBIMAP_HSHI_BINUM14_Pos                          20
#define USB3_GPRTBIMAP_HSHI_BINUM14_Msk                          (0xfUL << 20)
#define USB3_GPRTBIMAP_HSHI_BINUM14                              (0xfUL << 20)
#define USB3_GPRTBIMAP_HSHI_BINUM15_Pos                          24
#define USB3_GPRTBIMAP_HSHI_BINUM15_Msk                          (0xfUL << 24)
#define USB3_GPRTBIMAP_HSHI_BINUM15                              (0xfUL << 24)

/* Bit fields for USB3_GPRTBIMAP_FSLO register */
#define USB3_GPRTBIMAP_FSLO_BINUM1_Pos                           0
#define USB3_GPRTBIMAP_FSLO_BINUM1_Msk                           (0xfUL << 0)
#define USB3_GPRTBIMAP_FSLO_BINUM1                               (0xfUL << 0)
#define USB3_GPRTBIMAP_FSLO_BINUM2_Pos                           4
#define USB3_GPRTBIMAP_FSLO_BINUM2_Msk                           (0xfUL << 4)
#define USB3_GPRTBIMAP_FSLO_BINUM2                               (0xfUL << 4)
#define USB3_GPRTBIMAP_FSLO_BINUM3_Pos                           8
#define USB3_GPRTBIMAP_FSLO_BINUM3_Msk                           (0xfUL << 8)
#define USB3_GPRTBIMAP_FSLO_BINUM3                               (0xfUL << 8)
#define USB3_GPRTBIMAP_FSLO_BINUM4_Pos                           12
#define USB3_GPRTBIMAP_FSLO_BINUM4_Msk                           (0xfUL << 12)
#define USB3_GPRTBIMAP_FSLO_BINUM4                               (0xfUL << 12)
#define USB3_GPRTBIMAP_FSLO_BINUM5_Pos                           16
#define USB3_GPRTBIMAP_FSLO_BINUM5_Msk                           (0xfUL << 16)
#define USB3_GPRTBIMAP_FSLO_BINUM5                               (0xfUL << 16)
#define USB3_GPRTBIMAP_FSLO_BINUM6_Pos                           20
#define USB3_GPRTBIMAP_FSLO_BINUM6_Msk                           (0xfUL << 20)
#define USB3_GPRTBIMAP_FSLO_BINUM6                               (0xfUL << 20)
#define USB3_GPRTBIMAP_FSLO_BINUM7_Pos                           24
#define USB3_GPRTBIMAP_FSLO_BINUM7_Msk                           (0xfUL << 24)
#define USB3_GPRTBIMAP_FSLO_BINUM7                               (0xfUL << 24)
#define USB3_GPRTBIMAP_FSLO_BINUM8_Pos                           28
#define USB3_GPRTBIMAP_FSLO_BINUM8_Msk                           (0xfUL << 28)
#define USB3_GPRTBIMAP_FSLO_BINUM8                               (0xfUL << 28)

/* Bit fields for USB3_GPRTBIMAP_FSHI register */
#define USB3_GPRTBIMAP_FSHI_BINUM9_Pos                           0
#define USB3_GPRTBIMAP_FSHI_BINUM9_Msk                           (0xfUL << 0)
#define USB3_GPRTBIMAP_FSHI_BINUM9                               (0xfUL << 0)
#define USB3_GPRTBIMAP_FSHI_BINUM10_Pos                          4
#define USB3_GPRTBIMAP_FSHI_BINUM10_Msk                          (0xfUL << 4)
#define USB3_GPRTBIMAP_FSHI_BINUM10                              (0xfUL << 4)
#define USB3_GPRTBIMAP_FSHI_BINUM11_Pos                          8
#define USB3_GPRTBIMAP_FSHI_BINUM11_Msk                          (0xfUL << 8)
#define USB3_GPRTBIMAP_FSHI_BINUM11                              (0xfUL << 8)
#define USB3_GPRTBIMAP_FSHI_BINUM12_Pos                          12
#define USB3_GPRTBIMAP_FSHI_BINUM12_Msk                          (0xfUL << 12)
#define USB3_GPRTBIMAP_FSHI_BINUM12                              (0xfUL << 12)
#define USB3_GPRTBIMAP_FSHI_BINUM13_Pos                          16
#define USB3_GPRTBIMAP_FSHI_BINUM13_Msk                          (0xfUL << 16)
#define USB3_GPRTBIMAP_FSHI_BINUM13                              (0xfUL << 16)
#define USB3_GPRTBIMAP_FSHI_BINUM14_Pos                          20
#define USB3_GPRTBIMAP_FSHI_BINUM14_Msk                          (0xfUL << 20)
#define USB3_GPRTBIMAP_FSHI_BINUM14                              (0xfUL << 20)
#define USB3_GPRTBIMAP_FSHI_BINUM15_Pos                          24
#define USB3_GPRTBIMAP_FSHI_BINUM15_Msk                          (0xfUL << 24)
#define USB3_GPRTBIMAP_FSHI_BINUM15                              (0xfUL << 24)

/* Bit fields for USB3_GUCTL2 register */
#define USB3_GUCTL2_TxPingDuration_Pos                           0
#define USB3_GUCTL2_TxPingDuration_Msk                           (0x1fUL << 0)
#define USB3_GUCTL2_TxPingDuration                               (0x1fUL << 0)
#define USB3_GUCTL2_RxPingDuration_Pos                           5
#define USB3_GUCTL2_RxPingDuration_Msk                           (0x3fUL << 5)
#define USB3_GUCTL2_RxPingDuration                               (0x3fUL << 5)
#define USB3_GUCTL2_DisableCFC_Pos                               11
#define USB3_GUCTL2_DisableCFC_Msk                               (0x1UL << 11)
#define USB3_GUCTL2_DisableCFC                                   (0x1UL << 11)
#define USB3_GUCTL2_EnableEpCacheEvict_Pos                       12
#define USB3_GUCTL2_EnableEpCacheEvict_Msk                       (0x1UL << 12)
#define USB3_GUCTL2_EnableEpCacheEvict                           (0x1UL << 12)
#define USB3_GUCTL2_Rst_actbitlater_Pos                          14
#define USB3_GUCTL2_Rst_actbitlater_Msk                          (0x1UL << 14)
#define USB3_GUCTL2_Rst_actbitlater                              (0x1UL << 14)
#define USB3_GUCTL2_NOLOWPWRDUR_Pos                              15
#define USB3_GUCTL2_NOLOWPWRDUR_Msk                              (0xfUL << 15)
#define USB3_GUCTL2_NOLOWPWRDUR                                  (0xfUL << 15)
#define USB3_GUCTL2_EN_HP_PM_TIMER_Pos                           19
#define USB3_GUCTL2_EN_HP_PM_TIMER_Msk                           (0x7fUL << 19)
#define USB3_GUCTL2_EN_HP_PM_TIMER                               (0x7fUL << 19)

/* Bit fields for USB3_GUSB2PHYCFG register */
#define USB3_GUSB2PHYCFG_TOutCal_Pos                             0
#define USB3_GUSB2PHYCFG_TOutCal_Msk                             (0x7UL << 0)
#define USB3_GUSB2PHYCFG_TOutCal                                 (0x7UL << 0)
#define USB3_GUSB2PHYCFG_PHYIF_Pos                               3
#define USB3_GUSB2PHYCFG_PHYIF_Msk                               (0x1UL << 3)
#define USB3_GUSB2PHYCFG_PHYIF                                   (0x1UL << 3)
#define USB3_GUSB2PHYCFG_ULPI_UTMI_Sel_Pos                       4
#define USB3_GUSB2PHYCFG_ULPI_UTMI_Sel_Msk                       (0x1UL << 4)
#define USB3_GUSB2PHYCFG_ULPI_UTMI_Sel                           (0x1UL << 4)
#define USB3_GUSB2PHYCFG_FSINTF_Pos                              5
#define USB3_GUSB2PHYCFG_FSINTF_Msk                              (0x1UL << 5)
#define USB3_GUSB2PHYCFG_FSINTF                                  (0x1UL << 5)
#define USB3_GUSB2PHYCFG_SUSPENDUSB20_Pos                        6
#define USB3_GUSB2PHYCFG_SUSPENDUSB20_Msk                        (0x1UL << 6)
#define USB3_GUSB2PHYCFG_SUSPENDUSB20                            (0x1UL << 6)
#define USB3_GUSB2PHYCFG_PHYSEL_Pos                              7
#define USB3_GUSB2PHYCFG_PHYSEL_Msk                              (0x1UL << 7)
#define USB3_GUSB2PHYCFG_PHYSEL                                  (0x1UL << 7)
#define USB3_GUSB2PHYCFG_ENBLSLPM_Pos                            8
#define USB3_GUSB2PHYCFG_ENBLSLPM_Msk                            (0x1UL << 8)
#define USB3_GUSB2PHYCFG_ENBLSLPM                                (0x1UL << 8)
#define USB3_GUSB2PHYCFG_XCVRDLY_Pos                             9
#define USB3_GUSB2PHYCFG_XCVRDLY_Msk                             (0x1UL << 9)
#define USB3_GUSB2PHYCFG_XCVRDLY                                 (0x1UL << 9)
#define USB3_GUSB2PHYCFG_USBTRDTIM_Pos                           10
#define USB3_GUSB2PHYCFG_USBTRDTIM_Msk                           (0xfUL << 10)
#define USB3_GUSB2PHYCFG_USBTRDTIM                               (0xfUL << 10)
#define USB3_GUSB2PHYCFG_ULPIAUTORES_Pos                         15
#define USB3_GUSB2PHYCFG_ULPIAUTORES_Msk                         (0x1UL << 15)
#define USB3_GUSB2PHYCFG_ULPIAUTORES                             (0x1UL << 15)
#define USB3_GUSB2PHYCFG_ULPIEXTVBUSDRV_Pos                      17
#define USB3_GUSB2PHYCFG_ULPIEXTVBUSDRV_Msk                      (0x1UL << 17)
#define USB3_GUSB2PHYCFG_ULPIEXTVBUSDRV                          (0x1UL << 17)
#define USB3_GUSB2PHYCFG_ULPIEXTVBUSINDIACTOR_Pos                18
#define USB3_GUSB2PHYCFG_ULPIEXTVBUSINDIACTOR_Msk                (0x1UL << 18)
#define USB3_GUSB2PHYCFG_ULPIEXTVBUSINDIACTOR                    (0x1UL << 18)
#define USB3_GUSB2PHYCFG_LSIPD_Pos                               19
#define USB3_GUSB2PHYCFG_LSIPD_Msk                               (0x7UL << 19)
#define USB3_GUSB2PHYCFG_LSIPD                                   (0x7UL << 19)
#define USB3_GUSB2PHYCFG_LSTRD_Pos                               22
#define USB3_GUSB2PHYCFG_LSTRD_Msk                               (0x7UL << 22)
#define USB3_GUSB2PHYCFG_LSTRD                                   (0x7UL << 22)
#define USB3_GUSB2PHYCFG_INV_SEL_HSIC_Pos                        26
#define USB3_GUSB2PHYCFG_INV_SEL_HSIC_Msk                        (0x1UL << 26)
#define USB3_GUSB2PHYCFG_INV_SEL_HSIC                            (0x1UL << 26)
#define USB3_GUSB2PHYCFG_HSIC_CON_WIDTH_ADJ_Pos                  27
#define USB3_GUSB2PHYCFG_HSIC_CON_WIDTH_ADJ_Msk                  (0x3UL << 27)
#define USB3_GUSB2PHYCFG_HSIC_CON_WIDTH_ADJ                      (0x3UL << 27)
#define USB3_GUSB2PHYCFG_ULPI_LPM_WITH_OPMODE_CHK_Pos            29
#define USB3_GUSB2PHYCFG_ULPI_LPM_WITH_OPMODE_CHK_Msk            (0x1UL << 29)
#define USB3_GUSB2PHYCFG_ULPI_LPM_WITH_OPMODE_CHK                (0x1UL << 29)
#define USB3_GUSB2PHYCFG_U2_FREECLK_EXISTS_Pos                   30
#define USB3_GUSB2PHYCFG_U2_FREECLK_EXISTS_Msk                   (0x1UL << 30)
#define USB3_GUSB2PHYCFG_U2_FREECLK_EXISTS                       (0x1UL << 30)
#define USB3_GUSB2PHYCFG_PHYSOFTRST_Pos                          31
#define USB3_GUSB2PHYCFG_PHYSOFTRST_Msk                          (0x1UL << 31)
#define USB3_GUSB2PHYCFG_PHYSOFTRST                              (0x1UL << 31)

/* Bit fields for USB3_GUSB2PHYACC_UTMI register */
#define USB3_GUSB2PHYACC_UTMI_REGDATA_Pos                        0
#define USB3_GUSB2PHYACC_UTMI_REGDATA_Msk                        (0xffUL << 0)
#define USB3_GUSB2PHYACC_UTMI_REGDATA                            (0xffUL << 0)
#define USB3_GUSB2PHYACC_UTMI_EXTREGADDR_Pos                     8
#define USB3_GUSB2PHYACC_UTMI_EXTREGADDR_Msk                     (0xffUL << 8)
#define USB3_GUSB2PHYACC_UTMI_EXTREGADDR                         (0xffUL << 8)
#define USB3_GUSB2PHYACC_UTMI_REGADDR_Pos                        16
#define USB3_GUSB2PHYACC_UTMI_REGADDR_Msk                        (0x3fUL << 16)
#define USB3_GUSB2PHYACC_UTMI_REGADDR                            (0x3fUL << 16)
#define USB3_GUSB2PHYACC_UTMI_REGWR_Pos                          22
#define USB3_GUSB2PHYACC_UTMI_REGWR_Msk                          (0x1UL << 22)
#define USB3_GUSB2PHYACC_UTMI_REGWR                              (0x1UL << 22)
#define USB3_GUSB2PHYACC_UTMI_VSTSBSY_Pos                        23
#define USB3_GUSB2PHYACC_UTMI_VSTSBSY_Msk                        (0x1UL << 23)
#define USB3_GUSB2PHYACC_UTMI_VSTSBSY                            (0x1UL << 23)
#define USB3_GUSB2PHYACC_UTMI_VSTSDONE_Pos                       24
#define USB3_GUSB2PHYACC_UTMI_VSTSDONE_Msk                       (0x1UL << 24)
#define USB3_GUSB2PHYACC_UTMI_VSTSDONE                           (0x1UL << 24)
#define USB3_GUSB2PHYACC_UTMI_NEWREGREQ_Pos                      25
#define USB3_GUSB2PHYACC_UTMI_NEWREGREQ_Msk                      (0x1UL << 25)
#define USB3_GUSB2PHYACC_UTMI_NEWREGREQ                          (0x1UL << 25)
#define USB3_GUSB2PHYACC_UTMI_DISUIPIDRVR_Pos                    26
#define USB3_GUSB2PHYACC_UTMI_DISUIPIDRVR_Msk                    (0x1UL << 26)
#define USB3_GUSB2PHYACC_UTMI_DISUIPIDRVR                        (0x1UL << 26)

/* Bit fields for USB3_GUSB3PIPECTL register */
#define USB3_GUSB3PIPECTL_ELASTIC_BUFFER_MODE_Pos                0
#define USB3_GUSB3PIPECTL_ELASTIC_BUFFER_MODE_Msk                (0x1UL << 0)
#define USB3_GUSB3PIPECTL_ELASTIC_BUFFER_MODE                    (0x1UL << 0)
#define USB3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS_Pos                  1
#define USB3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS_Msk                  (0x3UL << 1)
#define USB3_GUSB3PIPECTL_SS_TX_DE_EMPHASIS                      (0x3UL << 1)
#define USB3_GUSB3PIPECTL_TX_MARGIN_Pos                          3
#define USB3_GUSB3PIPECTL_TX_MARGIN_Msk                          (0x7UL << 3)
#define USB3_GUSB3PIPECTL_TX_MARGIN                              (0x7UL << 3)
#define USB3_GUSB3PIPECTL_TX_SWING_Pos                           6
#define USB3_GUSB3PIPECTL_TX_SWING_Msk                           (0x1UL << 6)
#define USB3_GUSB3PIPECTL_TX_SWING                               (0x1UL << 6)
#define USB3_GUSB3PIPECTL_SSICEn_Pos                             7
#define USB3_GUSB3PIPECTL_SSICEn_Msk                             (0x1UL << 7)
#define USB3_GUSB3PIPECTL_SSICEn                                 (0x1UL << 7)
#define USB3_GUSB3PIPECTL_RX_DETECT_to_Polling_LFPS_Control_Pos  8
#define USB3_GUSB3PIPECTL_RX_DETECT_to_Polling_LFPS_Control_Msk  (0x1UL << 8)
#define USB3_GUSB3PIPECTL_RX_DETECT_to_Polling_LFPS_Control      (0x1UL << 8)
#define USB3_GUSB3PIPECTL_LFPSFILTER_Pos                         9
#define USB3_GUSB3PIPECTL_LFPSFILTER_Msk                         (0x1UL << 9)
#define USB3_GUSB3PIPECTL_LFPSFILTER                             (0x1UL << 9)
#define USB3_GUSB3PIPECTL_P3ExSigP2_Pos                          10
#define USB3_GUSB3PIPECTL_P3ExSigP2_Msk                          (0x1UL << 10)
#define USB3_GUSB3PIPECTL_P3ExSigP2                              (0x1UL << 10)
#define USB3_GUSB3PIPECTL_P3P2TranOK_Pos                         11
#define USB3_GUSB3PIPECTL_P3P2TranOK_Msk                         (0x1UL << 11)
#define USB3_GUSB3PIPECTL_P3P2TranOK                             (0x1UL << 11)
#define USB3_GUSB3PIPECTL_LFPSP0Algn_Pos                         12
#define USB3_GUSB3PIPECTL_LFPSP0Algn_Msk                         (0x1UL << 12)
#define USB3_GUSB3PIPECTL_LFPSP0Algn                             (0x1UL << 12)
#define USB3_GUSB3PIPECTL_SkipRxDet_Pos                          13
#define USB3_GUSB3PIPECTL_SkipRxDet_Msk                          (0x1UL << 13)
#define USB3_GUSB3PIPECTL_SkipRxDet                              (0x1UL << 13)
#define USB3_GUSB3PIPECTL_AbortRxDetInU2_Pos                     14
#define USB3_GUSB3PIPECTL_AbortRxDetInU2_Msk                     (0x1UL << 14)
#define USB3_GUSB3PIPECTL_AbortRxDetInU2                         (0x1UL << 14)
#define USB3_GUSB3PIPECTL_DATWIDTH_Pos                           15
#define USB3_GUSB3PIPECTL_DATWIDTH_Msk                           (0x3UL << 15)
#define USB3_GUSB3PIPECTL_DATWIDTH                               (0x3UL << 15)
#define USB3_GUSB3PIPECTL_SUSPENDENABLE_Pos                      17
#define USB3_GUSB3PIPECTL_SUSPENDENABLE_Msk                      (0x1UL << 17)
#define USB3_GUSB3PIPECTL_SUSPENDENABLE                          (0x1UL << 17)
#define USB3_GUSB3PIPECTL_DELAYP1TRANS_Pos                       18
#define USB3_GUSB3PIPECTL_DELAYP1TRANS_Msk                       (0x1UL << 18)
#define USB3_GUSB3PIPECTL_DELAYP1TRANS                           (0x1UL << 18)
#define USB3_GUSB3PIPECTL_DelayP1P2P3_Pos                        19
#define USB3_GUSB3PIPECTL_DelayP1P2P3_Msk                        (0x7UL << 19)
#define USB3_GUSB3PIPECTL_DelayP1P2P3                            (0x7UL << 19)
#define USB3_GUSB3PIPECTL_DisRxDetU3RxDet_Pos                    22
#define USB3_GUSB3PIPECTL_DisRxDetU3RxDet_Msk                    (0x1UL << 22)
#define USB3_GUSB3PIPECTL_DisRxDetU3RxDet                        (0x1UL << 22)
#define USB3_GUSB3PIPECTL_StartRxDetU3RxDet_Pos                  23
#define USB3_GUSB3PIPECTL_StartRxDetU3RxDet_Msk                  (0x1UL << 23)
#define USB3_GUSB3PIPECTL_StartRxDetU3RxDet                      (0x1UL << 23)
#define USB3_GUSB3PIPECTL_request_p1p2p3_Pos                     24
#define USB3_GUSB3PIPECTL_request_p1p2p3_Msk                     (0x1UL << 24)
#define USB3_GUSB3PIPECTL_request_p1p2p3                         (0x1UL << 24)
#define USB3_GUSB3PIPECTL_u1u2exitfail_to_recov_Pos              25
#define USB3_GUSB3PIPECTL_u1u2exitfail_to_recov_Msk              (0x1UL << 25)
#define USB3_GUSB3PIPECTL_u1u2exitfail_to_recov                  (0x1UL << 25)
#define USB3_GUSB3PIPECTL_ping_enhancement_en_Pos                26
#define USB3_GUSB3PIPECTL_ping_enhancement_en_Msk                (0x1UL << 26)
#define USB3_GUSB3PIPECTL_ping_enhancement_en                    (0x1UL << 26)
#define USB3_GUSB3PIPECTL_Ux_exit_in_Px_Pos                      27
#define USB3_GUSB3PIPECTL_Ux_exit_in_Px_Msk                      (0x1UL << 27)
#define USB3_GUSB3PIPECTL_Ux_exit_in_Px                          (0x1UL << 27)
#define USB3_GUSB3PIPECTL_DisRxDetP3_Pos                         28
#define USB3_GUSB3PIPECTL_DisRxDetP3_Msk                         (0x1UL << 28)
#define USB3_GUSB3PIPECTL_DisRxDetP3                             (0x1UL << 28)
#define USB3_GUSB3PIPECTL_U2P3ok_Pos                             29
#define USB3_GUSB3PIPECTL_U2P3ok_Msk                             (0x1UL << 29)
#define USB3_GUSB3PIPECTL_U2P3ok                                 (0x1UL << 29)
#define USB3_GUSB3PIPECTL_HstPrtCmpl_Pos                         30
#define USB3_GUSB3PIPECTL_HstPrtCmpl_Msk                         (0x1UL << 30)
#define USB3_GUSB3PIPECTL_HstPrtCmpl                             (0x1UL << 30)
#define USB3_GUSB3PIPECTL_PHYSoftRst_Pos                         31
#define USB3_GUSB3PIPECTL_PHYSoftRst_Msk                         (0x1UL << 31)
#define USB3_GUSB3PIPECTL_PHYSoftRst                             (0x1UL << 31)

